namespace PolygonLibrary.Polyhedra.ConvexPolyhedra; 

//todo
public class Polyhedron {

  // симплекс
  
  // полиэдральный комплекс: множество граней (Polyhedron), возможно с дополнительной информацией 
  // - множество рёбер с информацией каким двум граням оно принадлежит (получаем в процессе GW)
  // - множество вершин, для каждой вершины набор граней которым она принадлежит (нужна для MINK: + , -)
  // ??? может быть что-то ещё!

  // размерность многогранника == 3, тогда список граней это множество ConvexPolygonInMultidimensionalSpace <--
}
